//=============================================================================
//
// ディレイドタスク [DelayedTask.cpp]
// 役割：遅延して発生させるタスク
// Author:GP12B332 19 染谷武志
//
//=============================================================================
#include "DelayedTask.h"

//==========================================
// コンストラクタ
//==========================================
DelayedTask::DelayedTask(int delay, const std::function<void(void)>& task) :
	Task(task)
{
	time = delay;
}

//==========================================
// デストラクタ
//==========================================
DelayedTask::~DelayedTask()
{
}

//==========================================
// 更新
//==========================================
void DelayedTask::Update()
{
	if (current != State::Idle)
		return;

	cnt++;
	if (cnt == time)
	{
		func();
		current = State::Finished;
	}
}