//=============================================================================
//
// レギュラータスク [RegularTask.cpp]
// 役割：定期的に発生させるタスク
// Author:GP12B332 19 染谷武志
//
//=============================================================================
#include "RegularTask.h"

//==========================================
// コンストラクタ
//==========================================
RegularTask::RegularTask(int interval, const std::function<void(void)>& task) :
	Task(task)
{
	time = interval;
}

//==========================================
// デストラクタ
//==========================================
RegularTask::~RegularTask()
{
}

//==========================================
// 更新
//==========================================
void RegularTask::Update()
{
	if (current != State::Idle)
		return;

	cnt++;
	if (cnt == time)
	{
		func();
		cnt = 0;
	}
}
